<?php

return [
    'error' => [
        '9001' => ['code' => '9001', 'message' => '無效請求參數'],
        '9002' => ['code' => '9002', 'message' => 'r-k系統錯誤'], // 無法產生redis key

        '1000' => ['code' => '1000', 'message' => '禁止跨平台轉帳'],
        '1001' => ['code' => '1001', 'message' => '無效請求參數'],

        '1101' => ['code' => '1101', 'message' => '平台已下架'],
        '1102' => ['code' => '1102', 'message' => '平台正在維護'],
        '1103' => ['code' => '1103', 'message' => '平台禁止交易'],
        '1104' => ['code' => '1104', 'message' => '帳號不存在'],
        '1105' => ['code' => '1105', 'message' => '帳號已凍結'],

        '1106' => ['code' => '1106', 'message' => '餘額不足'],
        '1107' => ['code' => '1107', 'message' => '交易密碼錯誤'],

        '1201' => ['code' => '1201', 'message' => '平台已下架'],
        '1202' => ['code' => '1202', 'message' => '平台正在維護'],
        '1203' => ['code' => '1203', 'message' => '平台禁止交易'],
        '1204' => ['code' => '1204', 'message' => '帳號不存在'],
        '1205' => ['code' => '1205', 'message' => '帳號已凍結'],

        '1301' => ['code' => '1301', 'message' => 'tx-c交易失敗'],
    ]
];
